// ===============================================================================
// 浪潮GSP平台
// 关系运算符枚举
// 请查看《GSP7-******子系统概要设计说明书》来了解关于此类的更多信息。
// ===============================================================================
// 变更历史纪录
// 时间			             版本	    修改人	        描述
// 2013/11/27 15:37:31        1.0        zhougq           添加头注释。
// ===============================================================================
// 开发者: zhougq
// 2013/11/27 15:37:31 
// (C) 2013 Genersoft Corporation 版权所有
// 保留所有权利。
// ===============================================================================

using System;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Collections.Generic;

namespace NSharding.DataAccess.Core
{
    /// <summary>
    /// 关系运算符枚举
    /// </summary>
    /// <remarks>关系运算符枚举</remarks>
    public enum OperatorType
    {
        And,
        Or
    }
}
